;==============================================НОМЕР 1.2-10=============================================================
; Первая практическая работа, узнающая, что является-ли число кубом какого-либо иного числа. Если да,то какого именно? 
;=======================================================================================================================

found:  mov si,cx

;Int > String
mov AX,SI ; ax - число
mov BX,buffer+100 ;bx адрес конца строки

cont2:  mov CX,10 ;делим на 10
mov DX,0
div CX
add DX,48;dx - символ

dec BX
mov [BX],DL;

cmp AX,0
jne cont2

;Output
mov DX,BX;dx - адрес начала строки

mov CX,buffer+100
sub CX,BX;cx - длина сторки

;mov cx,ax     ;cx - сколько байт
;mov dx,buffer ;DS:DX - адрес

mov BX,1      ;bx = 1 вывод на экран
mov AH,40h    ;40h - вывод
int 21h

;Exit
mov ax,4c00h
int 21h

;Data
buffer  db 100 dup (?)